![license_header_logo](https://user-images.githubusercontent.com/59526258/124226124-27125b80-db3b-11eb-8ba1-488d88018ebb.png)
> **Copyright (c) 2020-2021 CertifAI Sdn. Bhd.**<br>
 <br>
This program is part of OSRFramework. You can redistribute it and/or modify
<br>it under the terms of the GNU Affero General Public License as published by
<br>the Free Software Foundation, either version 3 of the License, or
<br>(at your option) any later version.
<br>
<br>This program is distributed in the hope that it will be useful,
<br>but WITHOUT ANY WARRANTY; without even the implied warranty of
<br>MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
<br>GNU Affero General Public License for more details.
<br>
<br>You should have received a copy of the GNU Affero General Public License
<br>along with this program.  If not, see <http://www.gnu.org/licenses/>.
<br>

# Introduction

Feature engineering is a machine learning techniques for extracting new features from raw data.
In this notebook, we will explore on different types of feature engineering techniques:
1. Imputation
2. One-hot encoding for categorical data.
3. Categorize numerical data.

# Learning Outcome
By the end of this notebook, you should be able to know on how to:
1. Perform feature engineering for missing values. 
2. Handling categorical data (binary, nominal, ordinal)
3. Implement feature engineering for numerical data.

# Table Of Contents
* [Missing values](#missing)
* [Categorical data](#category)
* [Numerical data](#numeric)
* [Exercise ](#exercise)

In [1]:
import pandas as pd
import numpy as np
from sklearn import preprocessing

In [2]:
# Dataset of employee
df = pd.DataFrame({
    "Employee ID" : ['100', '101', '102', '103', '104', '105', '106', '107', '108', '109'],
    "Department" : ["Finance", "IT", "Sales", "Human Resource", "Finance", "IT", "Sales", "Finance", "Sales", "IT"],
    "Age" : [24, np.nan, 18, 28, 29, 28, 30, 35, np.nan, 35],
    "Gender" : ["F", "M", "F", "F", "F", "M", "M", "M", "F", "F"],
    "Education" : ["Diploma", "Diploma", "SPM", "Degree", "Degree", "SPM", "Degree", "SPM", "Diploma", "Degree"]
    })

In [3]:
# Change Employee ID as int data type
df['Employee ID'] = df['Employee ID'].astype(int)

In [4]:
df.head()

   Employee ID      Department   Age Gender Education
0          100         Finance  24.0      F   Diploma
1          101              IT   NaN      M   Diploma
2          102           Sales  18.0      F       SPM
3          103  Human Resource  28.0      F    Degree
4          104         Finance  29.0      F    Degree

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Employee ID  10 non-null     int32
 1   Department   10 non-null     object
 2   Age          8 non-null      float64
 3   Gender       10 non-null     object
 4   Education    10 non-null     object
dtypes: float64(1), int32(1), object(3)
memory usage: 488.0+ bytes

# <a name="typeformat">Missing Values

There are two methods to handle missing values:
1. <b>Deleting information</b> that has missing value on it.
    * Delete entire column
    * Delete entire rows
    
    
2. <b>Imputation</b>
    * Impute using mean 
    * Impute using mode

In [6]:
# Print the value that has missing values
df.isnull().sum()

Employee ID    0
Department     0
Age            2
Gender         0
Education      0
dtype: int64

## Deleting value
Deleting certain row with missing data, or certain column with missing data.

### Column

In [7]:
del_column = df.dropna(axis=1)

In [8]:
del_column.head()

   Employee ID      Department Gender Education
0          100         Finance      F   Diploma
1          101              IT      M   Diploma
2          102           Sales      F       SPM
3          103  Human Resource      F    Degree
4          104         Finance      F    Degree

### Row

In [9]:
del_row = df.dropna(axis=0)

In [10]:
del_row.head()

   Employee ID      Department   Age Gender Education
0          100         Finance  24.0      F   Diploma
2          102           Sales  18.0      F       SPM
3          103  Human Resource  28.0      F    Degree
4          104         Finance  29.0      F    Degree
5          105              IT  28.0      M       SPM

## Imputation
Replacing missing data with statistical estimates of the missing values. 

Numerical value:
1. Mean
2. Mode
3. Median

Categorical value:
1. Frequently use value or mode imputation.
2. Adding a "missing"/"unknown" category.

In this exercise we will show on how to imputate missing values by using mean or mode.

### Mean
Fills up the missing value by mean.

In [11]:
mean = df.fillna(df.mean().astype(int))

In [12]:
mean.head()

   Employee ID      Department   Age Gender Education
0          100         Finance  24.0      F   Diploma
1          101              IT  28.0      M   Diploma
2          102           Sales  18.0      F       SPM
3          103  Human Resource  28.0      F    Degree
4          104         Finance  29.0      F    Degree

### Mode
Fills up the missing value by mode.

In [13]:
mode = df.fillna(df.mode())

In [14]:
mode.head()

   Employee ID      Department   Age Gender Education
0          100         Finance  24.0      F   Diploma
1          101              IT  35.0      M   Diploma
2          102           Sales  18.0      F       SPM
3          103  Human Resource  28.0      F    Degree
4          104         Finance  29.0      F    Degree

# <a name="category">Categorical data
Carry out feature engineering process on binary, nominal and ordinal.

In [15]:
# Print unique value of cat_df
for i in df.columns:
    if df.dtypes[i] == 'object':
        print("Column: {}".format(i))
        print(df[i].unique())

Column: Department
['Finance' 'IT' 'Sales' 'Human Resource']
Column: Gender
['F' 'M']
Column: Education
['Diploma' 'SPM' 'Degree']

From the result above, here is the list of categorical data:
* Binary : Gender
* Nominal : Department
* Ordinal : Education

## Binary Data
Perform one-hot-encoding by using `get_dummies`. The first category of our data will be remove by using the **drop_first=True** because it contain the same information. It will be remove to prevent data redundancy in out dataset.

In [16]:
df = pd.get_dummies(data=df, columns=['Gender'], drop_first=True)

In [17]:
df = df.rename(columns={"Gender_M":"Gender"})

In [18]:
df.head()

   Employee ID      Department   Age Education  Gender
0          100         Finance  24.0   Diploma       0
1          101              IT   NaN   Diploma       1
2          102           Sales  18.0       SPM       0
3          103  Human Resource  28.0    Degree       0
4          104         Finance  29.0    Degree       0

Take a quick look on Gender column, value 1 represent as male and 0 as female.

## Nominal Data
They are two method to perform feature engineering for nominal data:
### Label Encoder

In [19]:
df_encode = df.copy()

In [20]:
label_encoder = preprocessing.LabelEncoder()

In [21]:
df_encode['Department'] = label_encoder.fit_transform(df_encode['Department'])

In [22]:
df_encode.head()

   Employee ID  Department   Age Education  Gender
0          100           0  24.0   Diploma       0
1          101           2   NaN   Diploma       1
2          102           3  18.0       SPM       0
3          103           1  28.0    Degree       0
4          104           0  29.0    Degree       0

Label encoding use alphabetical ordering. Thus the values in Department column will resulted in the following order :<br>
<b>Finance > Human Resource > IT > Sales</b><br>

Department names do not have an order or rank. When label encoding is performed, it will create order relationship between the categories.

### One-Hot Encoding

In [23]:
df = pd.get_dummies(data=df, columns=['Department'])

In [24]:
df.head()

,Employee ID,Age,Education,Gender,Department_Finance,Department_Human Resource,Department_IT,Department_Sales
0,100,24.0,Diploma,0,1,0,0,0
1,101,NaN,Diploma,1,0,0,1,0
2,102,18.0,SPM,0,0,0,0,1
3,103,28.0,Degree,0,0,1,0,0
4,104,29.0,Degree,0,1,0,0,0

**Challenges of One-Hot Encoding**
* Expands feature space
* Many features may look identical, this will leads to redundant information.

## Ordinal data

In [25]:
# Creating dictionary for mapping the ordinal numerical value
education_dict = {'SPM':1, 'Diploma':2, 'Degree':3}

# Assigning ordinal numerical value to all types of education
df['Education'] = df['Education'].map(education_dict)

In [26]:
df.head()

,Employee ID,Age,Education,Gender,Department_Finance,Department_Human Resource,Department_IT,Department_Sales
0,100,24.0,2,0,1,0,0,0
1,101,NaN,2,1,0,0,1,0
2,102,18.0,1,0,0,0,0,1
3,103,28.0,3,0,0,1,0,0
4,104,29.0,3,0,1,0,0,0

Best practice by mapping them into a new numeric value.

# <a name="numeric">Numeric data
Categorize values in Age columns according to their age stages.

In [27]:
# Slice age values
df['Age_Group'] = pd.cut(df['Age'], bins=[0, 18, 25, 30, 35, 40])

In [28]:
df.head()

,Employee ID,Age,Education,Gender,Department_Finance,Department_Human Resource,Department_IT,Department_Sales,Age_Group
0,100,24.0,2,0,1,0,0,0,"(18.0, 25.0]"
1,101,NaN,2,1,0,0,1,0,NaN
2,102,18.0,1,0,0,0,0,1,"(0.0, 18.0]"
3,103,28.0,3,0,0,1,0,0,"(25.0, 30.0]"
4,104,29.0,3,0,1,0,0,0,"(25.0, 30.0]"

# <a name="exercise">Exercise
Perform feature engineering based on dataset given below.

In [29]:
food = pd.read_csv('../data/food_preference.csv')

In [30]:
food.head()

,Timestamp,Participant_ID,Gender,Nationality,Age,Food,Juice,Dessert
0,2019/05/07 2:59:13 PM GMT+8,FPS001,Male,Indian,24,Traditional food,Fresh Juice,Maybe
1,2019/05/07 2:59:45 PM GMT+8,FPS002,Female,Indian,22,Western Food,Carbonated drinks,Yes
2,2019/05/07 3:00:05 PM GMT+8,FPS003,Male,Indian,31,Western Food,Fresh Juice,Maybe
3,2019/05/07 3:00:11 PM GMT+8,FPS004,Female,Indian,25,Traditional food,Fresh Juice,Maybe
4,2019/05/07 3:02:50 PM GMT+8,FPS005,Male,Indian,27,Traditional food,Fresh Juice,Maybe

<b>You may follow guidelines below to begin this exercise. Good luck!

In [31]:
# Step 1 : Check if there is missing value

In [32]:
# Step 2 : Deleting row that contain null value

In [33]:
# Step 3 : Find unique values for categorical columns only

# remove 'Timestamp' and 'Participant_ID' columns
cat_df = food[food.columns.difference(['Timestamp', 'Participant_ID'])]

# Print unique value of cat_df

In [34]:
# Step 4 : Standardize Nationality values to malaysian and non-malaysian

# Hint : use this values
nationality = {
    "malaysian" : "malaysian",
    "indian" : "non-malaysian",
    "pakistani" : "non-malaysian",
    "tanzanian" : "non-malaysian",
    "indonesia" : "non-malaysian",
    "pakistan" : "non-malaysian",
    "maldivian" : "non-malaysian",
    "my" : "malaysian",
    "indonesian" : "non-malaysian",
    "malaysia" : "malaysian",
    "canadian" : "non-malaysian",
    "nigerian" : "non-malaysian",
    "algerian" : "non-malaysian",
    "korean" : "non-malaysian",
    "seychellois" : "non-malaysian",
    "indonesain" : "non-malaysian",
    "japan" : "non-malaysian",
    "china" : "non-malaysian",
    "mauritian" : "non-malaysian",
    "yemen" : "non-malaysian"
}

In [35]:
# Step 5 : Perform feature engineering for the rest of categorical data

cat_df = food[food.columns.difference(['Timestamp', 'Participant_ID', 'Age'])]

In [38]:
# Step 6(Bonus) : Extract date from 'Timestamp column'

import datetime

# Hint : New date format %d%m%Y
def date_convert(date_to_convert):
    try:
        return datetime.datetime.strptime(date_to_convert, "%Y/%m/%d %H:%M:%S %p GMT+8").strftime('%d/%m/%Y')
    except:
        return "Error"

In [40]:
# food.head()

Congratulations, now you have a better understanding of how to include feature engineering into your project.

# Further Readings
* <a href=https://heartbeat.comet.ml/hands-on-with-feature-engineering-techniques-encoding-categorical-variables-be4bc0715394>More feature engineering techniques</a>